[{"fields": {"model": "logentry", "name": "log entry", "app_label": "admin"}, "model": "contenttypes.contenttype", "pk": 1}, {"fields": {"model": "permission", "name": "permission", "app_label": "auth"}, "model": "contenttypes.contenttype", "pk": 2}, {"fields": {"model": "group", "name": "group", "app_label": "auth"}, "model": "contenttypes.contenttype", "pk": 3}, {"fields": {"model": "user", "name": "user", "app_label": "auth"}, "model": "contenttypes.contenttype", "pk": 4}, {"fields": {"model": "contenttype", "name": "content type", "app_label": "contenttypes"}, "model": "contenttypes.contenttype", "pk": 5}, {"fields": {"model": "session", "name": "session", "app_label": "sessions"}, "model": "contenttypes.contenttype", "pk": 6}, {"fields": {"model": "post", "name": "post", "app_label": "blog"}, "model": "contenttypes.contenttype", "pk": 7}, {"fields": {"expire_date": "2015-04-19T15:22:59.838Z", "session_data": "YTA5MmRiZWQxZDEyZDNhMjQ0ZGUyNDdkM2Q5MzI4Y2RmMjUzOTU4NDp7Il9hdXRoX3VzZXJfaGFzaCI6Ijg4ZTBkZDZhNjFlOWU0OWU4NmEyNTU3NDdjNDg2NDliMmQwZTlkNDAiLCJfYXV0aF91c2VyX2JhY2tlbmQiOiJkamFuZ28uY29udHJpYi5hdXRoLmJhY2tlbmRzLk1vZGVsQmFja2VuZCIsIl9hdXRoX3VzZXJfaWQiOjF9"}, "model": "sessions.session", "pk": "d2mh14bfjlhgjicnvzx732mqqrtda983"}, {"fields": {"is_project": true, "title": "The OncoTime Programming Language", "image": "./ProjectPostPlaceHolder.png", "content": "<div id=\"main\">\r\n\t  <div id=\"main\">\r\n        <div class=\"content\">\r\n\r\n\t\t\t<h2 id=\"content-subhead\"> Introduction </h2>\t\r\n\t\t\t\r\n\t\t\t<p id=\"introduction\">\r\n\t\t\t\tThe OncoTime Programming language was designed by professor <a href=\"http://www.sable.mcgill.ca/~hendren/\">Laurie Hendren</a> as a solution to problems faced by doctors in the Radiation Oncology laboratory at the <a href=\"http://muhc.ca/clinic/radio-oncology-clinic-mgh-radio-oncology\">Montreal General Hospital.</a> The hospital had a program, wherein Doctor, Patient, and Diagnosis data was all stored in a <b>MySQl</b> database. The issue was that Doctors, not trained in programming or database querying, found it very difficult to access the data and information they needed. OncoTime acted as a solution. \r\n\t\t\t</p>\r\n\r\n\t\t\t<p id=\"introduction\"> \r\n\t\t\t\tOncoTime is a general purpose, \"wrapper\" language that allows users to quickly write simply programs that will allow them access to the information they need, quickly, and efficiently. It was written in the <b>C Programming Language</b> using <a href=\"http://aquamentus.com/flex_bison.html\">Flex / Bison</a> My team developed the <i>otc</i> OncoTime compiler which took OncoTime programs and created <b> Python </b> code that would access and display the results of the MySQL queries to the user.\r\n\t\t\t</p>\r\n\t\t\t\r\n\t\t\t<div class=\"article-image-centered\">\r\n\t\t\t\t<img id=\"article-image\" src=\"../../static/images/onco.png\">\r\n                               <p class=\"article-image-text\"> We were able to create great graphs to make it easier for doctors </p>\r\n\r\n\t\t\t</div>\r\n\r\n\t\t\t<p id=\"introduction\">\r\n\t\t\t\tWe are currently in the process of making the source code available unders and open source license. The idea being that we want everyone to have access to the OncoTime language, as well as allow intelligent developers to help us further develop the language. \r\n\t\t\t</p>\r\n\r\n\t\t\t<h2 id=\"content-subhead\"> Looking Forward </h2>\r\n\t\t\r\n\t\t\t<p id=\"introduction\">\r\n\t\t\t\tWe want to continue to develop and work on OncoTime. As such, I will be working with Laurie this summer to create a Web interface for OncoTime, wherein which potential users  <b> don't have to learn the language to get access to the data. </b> I think this will be a great step forward for OncoTime and for the users at the Hospital, who an continue to improve patient care by getting access to the information they need. \r\n\t\t\t</p>\r\n\r\n        </div>\r\n</div>", "short_description": "This article describes the OncoTime Programming Language project I developed while at McGill University. ", "published": true, "date": "2015-04-15T15:54:03Z", "slug": "oncotime"}, "model": "blog.post", "pk": 4}, {"fields": {"is_project": true, "title": "My Summer Projects at Microsoft", "image": "./ProjectPostPlaceHolder.png", "content": "<div id=\"main\">\r\n\t  <div id=\"main\">\r\n        <div class=\"content\">\r\n\r\n\t\t\t<h2 id=\"content-subhead\"> Introduction </h2>\t\r\n\t\t\t\r\n\t\t\t<p id=\"introduction\">\r\n\t\t\t\tLast Summer I was fortunate enough to be a Summer intern at Microsoft. (Now, that in itself was an experience, and I urge you to take a look at my article detailing my experiences). The Summer was particularily interesting because I had the chance to develop two great apps that helped us get a better understanding of the Highlights and Pain Points facing developers who wish to develop on the new <a href=\"https://dev.windows.com/en-us/develop/building-universal-windows-apps\">Universal Application Development Environment. </a>\r\n\t\t\t</p>\r\n\r\n\t\t\t<p id=\"introduction\">In this article, I wanted to give you a quick idea of what the two applications did, so as to provide you with a better understanding of the sorts of work I did this last Summer.</p> \r\n\r\n\t\t\t<h2 id=\"content-subhead\"> Open States </h2>\r\n\t\t\r\n\t\t\t<p id=\"introduction\">\r\n\t\t\t\tI developed the first application in order to get a better understanding of how difficult it would be to port an application from iOS to Windows. As such, I chose the <a href=\"https://itunes.apple.com/us/app/open-states/id500672932?mt=8\"> Open States iOS </a> application.\r\n \t\t\t</p>\r\n\r\n \t\t\t<p id=\"introduction\">\r\n \t\t\t\tThe concept behind OpenStates was simple enough. The application pulls data from <a href=\"http://sunlightlabs.github.io/openstates-api/\">Sun Light Labs, Open States API. </a> The data regarding Politicians, their constiuencies, and their policies, are then displayed to the user in the iOS app. \r\n \t\t\t</p>\r\n\r\n<div class=\"article-image-centered\">\r\n    <img style=\"width:300px\" id=\"article-image\" src=\"../../static/images/OpenStates.png\">\r\n    <p class=\"article-image-text\"> The original OpenStates app. Taken from <a href=\"https://itunes.apple.com/us/app/open-states/id500672932?mt=8\"> iTunes</a></p>\r\n</div>\r\n\r\n \t\t\t<p id=\"introduction\">\r\n \t\t\t\tFor my part, I developed a Universal Application using the <b>C# Programming Language</b> and the Universal Application Framework. The final product was then demonstrated to my team, and I wrote a report detailing my experiences. Unfortunately, the information contained in that report is not available for the public. \r\n \t\t\t</p>\r\n\r\n\t\t\t<h2 id=\"content-subhead\"> Recipe Guide </h2>\r\n\r\n\t\t\t<p id=\"introduction\">\r\n\t\t\t\tThe second application was developed in order to test <a href=\"https://cordova.apache.org/\"> Apache Cordova.</a> This absolutely wonderful tool allows developers to write one single application in <b>HTML/CSS and Javascript </b>, and then deploy that app on a wide variety of mobile and tablet form factors. \r\n \t\t\t</p>\r\n\r\n<div class=\"article-image-centered\">\r\n    <img id=\"article-image\" src=\"../../static/images/yummly.png\">\r\n    <p class=\"article-image-text\"><a href=\"https://developer.yummly.com/\">Yummly</a> is a great tool to get information about recipes</p>\r\n</div>\r\n \t\t\t<p id=\"introduction\">\r\n \t\t\t\tRecipe Guide, the application I built, simply got information from <a href=\"https://developer.yummly.com/\"> Yummly </a> and displayed the information to the user. The actual application allowed users to have profiles, store favourite recipes, create grocery lists from recipies, and view the nutritional and taste information. I wrote the application using <b>HTML/CSS and Javascript </b> and deployed it on a variety of form factors, including multiple Windows phone devices, an iPhone, and an Android Tablet.\r\n \t\t\t</p>\r\n\t\t\r\n\t\t\t<h2 id=\"content-subhead\"> Looking Forward </h2>\r\n\r\n\t\t\t<p id=\"introduction\">I am pleased to be returning back to Microsoft in the Fall to continue my work on improving the developer experience. I will be working with the Universal Applications Team as a Software Development Engineer in Seattle, WA. </p>\r\n\t\t\t\r\n\r\n        </div>\r\n</div>", "short_description": "This article describes the two projects I worked on while at Microsoft last Summer; Recipe Guide and OpenStates. It gives an introduction to both apps, along with the technologies used. ", "published": true, "date": "2015-04-15T15:55:00Z", "slug": "microsoft"}, "model": "blog.post", "pk": 5}, {"fields": {"is_project": true, "title": "Asteria: Battle for the Frontier", "image": "./ProjectPostPlaceHolder.png", "content": "<div id=\"main\">\r\n\t  <div id=\"main\">\r\n        <div class=\"content\">\r\n\r\n\t\t\t<h2 id=\"content-subhead\"> Introduction </h2>\t\r\n\t\t\t\r\n\t\t\t<p id=\"introduction\">Many Computer Science programs have students creating a large scale applicaiton at the end of their program. For me, that was Asteria: Battle for the Frontier. </p> The project (a team based activity, which posed it's own difficulties) was to build a game using any language and any libraries we chose. This article outlines the details of the project. \r\n\r\n\t\t\t<h2 id=\"content-subhead\"> The Game </h2>\r\n\r\n<div class=\"article-image-centered\">\r\n    <img id=\"article-image\" src=\"../../static/images/spaceships.png\">\r\n    <p class=\"article-image-text\">The start page for Asteria: Battle for the Frontier</p>\r\n</div>\r\n\r\n\r\n\t\t\t<p id=\"introduction\">Asteria: Battle for the Frontier is a real time, online multiplayer, strategy game. Players are matched up in real time with other players from around the world. Each player has an assortment of 7 ships (2 Destroyers, 2 MineLayers, 2 Cruisers, 1 Gunboat) The game begins with the players selecting where they would like to place their ships. Once all the ships have been placed, the action begins!</p>\r\n\r\n\t\t\t<p id=\"introduction\">Players must control their ships, each with varying speeds and capabilities, and attack and destroy either all the opponents ships, or their base. If a players ship is damaged, it can retreat back to the base in order to heal itself. Moreover, proximity mines can be laid that upon notification that a ship (enemy or friendly) is next to a mine, detonates damaging all ships in the surrounding area.</p>\r\n\t\t\t\r\n\t\t\t<h2 id=\"content-subhead\">The Technical Details </h2>\r\n\r\n\t\t\t<p id=\"introduction\">Firstly, it should be noted that the source code is available, open source, at <a href=\"https://github.com/emiraydin/spaceships\">Github.</a> Feel free to take a look.</p>\r\n\r\n\t\t\t<p id=\"introduction\">The progam was written entirely in Java using the <a href=\"http://libgdx.badlogicgames.com/\"> LibGDX</a> development environment. We wrote the networking ourselves, using Java Sockets in order to transfer data. Moreover, we wrote the code for the server, that handled the majority of the game logic. This meant that players computers simply needed to have access to the graphics rendering code, meaning their own overhead was very low. Since the game was rendered in 2D using simple Geometric Shapes, the overhead on any one computer was quite low. This meant that the bottleneck, if any, would occur on the server, meaning both players would be affected equally, thus limiting the implications on gameplay. </p>\r\n\t\t\t\r\n\t\t\t<p id=\"introduction\"> If anyone wants to learn about LibGDX game development, I strongly urge them to check out <a href=\"http://www.amazon.com/Learning-Libgdx-Development-Andreas-Oehlke/dp/1782166041\"> Learning LibGDX Game Development by Andreas Oehike. </a> This is the book we chose to use and it definitely made our lives easier. </p>\r\n\r\n        </div>\r\n</div>", "short_description": "This article describes Asteria: Battle for the Frontier. It is a 2D, real time, online multiplayer game, written in Java. The article should give the reader of what Asteria was and how it was built.", "published": true, "date": "2015-04-15T15:56:00Z", "slug": "spaceships"}, "model": "blog.post", "pk": 6}, {"fields": {"is_project": false, "title": "The Five Things Every Developer Should Do", "image": "./BlogPostPlaceHolder.png", "content": "<div id=\"main\">\r\n\t  <div id=\"main\">\r\n        <div class=\"content\">\r\n\r\n\t\t\t<h2 id=\"content-subhead\"> (1) Read, Read, Read </h2>\r\n\r\n\t\t\t<p id=\"introduction\">It's a little ironic that I should be writing this number 1 'do' because I switched from the Humanities to Computer Science because I was tired of reading. The fact remains though, that technology is always changing and evolving. We developers and engineers can't afford not to keep up with the latest developments and news. With respect to getting developer news, its as easy as spending 15 minutes on <a href=\"http://news.ycombinator.com\">HackerNews</a> or <a href=\"http://reddit.com/r/programming\">/r/Programming</a></p>\r\n\r\n\t\t\t<p id=\"introduction\">It is also important the developers and engineers keep reading about what facinates them in their particular field. For example, I am very interested in Compiler Design, so I am currently making my way through <a href=\"http://www.amazon.ca/Crafting-Compiler-Charles-N-Fischer/dp/0136067050\"> Crafting a Compiler.</a> This way, not only am I staying passionate about my field, but I am also increasing my worth as a developer by increasing the knowledge I have.</p>\r\n\r\n\t\t\t<h2 id=\"content-subhead\"> (2) Write, Write, Write </h2>\t\r\n\r\n\t\t\t<p id=\"introduction\">Know something not very many people know about? Share it with the world! Not only does writing (or abstracted, teaching) help solidify your own knowledge, you could be providing a resource that many people are looking for. Have you had a summer internship at a high profile company? Write about your experiences interviewing and working their. Did you work on a really cool project, using hot new technologies? Write about how those technologies worked and how your project worked. The possibilites are endless. </p>\r\n\r\n\r\n\t\t\t<p id=\"introduction\"> Not only does writing help the reader, it also helps you. Imagine you were working on a project and didn't understand a topic. You found a great blog article explaining that topic clearly, and simply. Maybe you want the guy or gal who wrote that article on your team! This happens all the time, in a field where technical expertise are so highly valued, companies will work day and night to get developers who have shown their skills through blogs and other written sources. </p>\r\n\r\n\t\t\t<h2 id=\"content-subhead\"> (3) Contribute to Open Source Code </h2>\t\r\n\r\n\r\n\t\t\t<p id=\"introduction\"> Much in the same light as the previous point, contributing to open source code is a great way to increase your knowledge as a developer, while simultaneously getting your name out there. If you contribute to a variety of projects you will quickly build experience that will help on the job. </p>\r\n\r\n\r\n\t\t\t<p id=\"introduction\"> Moreoer, Open Source projects are a great way to contribute back to the community. The projects provide free services that thousands of people can use, irrespective of whether they are developers or not. You may even find that the deeper you get into the open source community, the more interesting projects you find. </p>\r\n\r\n\t\t\t<h2 id=\"content-subhead\"> (4) Ask Questions </h2>\t\r\n\r\n\t\t\t<p id=\"introduction\"> if you don't understand something, ask someone who does. This conept is not overly difficult, but I find many developers will often be afraid of looking stupid or incompetent if they ask a question. It's important to know that <b>no project can be completed without help</b> and that <b>you are hurting the project by not asking questions and making assumptions</b> </p>\r\n\r\n\t\t\t<h2 id=\"content-subhead\"> (5) Work in Teams </h2>\t\r\n\t\t\t<p id=\"introduction\"> Finally, it is important to recognize that no developer works by themselves. The idea that Comptuer Scientists are reclusive individuals who huddle away in dark basements working on technical projects is far flung from reality. You will find yourself working in teams more often then not, and only very rarely will you have a piece of code you wrote entirely by yourself. Work in teams, get used to working in teams, and learn what makes a team thrive.</p>\r\n\r\n\t\t\t<p id=\"introduction\">You will be a better developer for it. </p>\r\n        </div>\r\n</div>", "short_description": "We discuss what the top five things all developers should do. This should give the reader a good idea of how to develop their developer skills. ", "published": true, "date": "2015-04-15T15:57:16Z", "slug": "five-dos-developers"}, "model": "blog.post", "pk": 7}, {"fields": {"is_project": false, "title": "The Five Things Every Developer Should Not Do", "image": "./BlogPostPlaceHolder.png", "content": "\r\n\r\n        <div class=\"content\">\r\n\r\n\t\t\t<h2 id=\"content-subhead\"> (1) Panic </h2>\t\r\n\r\n\t\t\t<h2 id=\"content-subhead\"> (2) Write Code Without Testing </h2>\t\r\n\r\n\t\t\t<h2 id=\"content-subhead\"> (3) Assign Blame </h2>\t\r\n\r\n\t\t\t<h2 id=\"content-subhead\"> (4) Work in a Silo </h2>\t\r\n\r\n\t\t\t<h2 id=\"content-subhead\"> (5) Assume You Know Everything </h2>\t\r\n\t\t\t\r\n        </div>\r\n</div>", "short_description": "In tandem with the Five Do's For Developers Article, this article gives the reader an idea of what to avoid as a developer. ", "published": true, "date": "2015-04-15T15:58:28Z", "slug": "five-donts-developers"}, "model": "blog.post", "pk": 8}, {"fields": {"codename": "add_logentry", "name": "Can add log entry", "content_type": 1}, "model": "auth.permission", "pk": 1}, {"fields": {"codename": "change_logentry", "name": "Can change log entry", "content_type": 1}, "model": "auth.permission", "pk": 2}, {"fields": {"codename": "delete_logentry", "name": "Can delete log entry", "content_type": 1}, "model": "auth.permission", "pk": 3}, {"fields": {"codename": "add_permission", "name": "Can add permission", "content_type": 2}, "model": "auth.permission", "pk": 4}, {"fields": {"codename": "change_permission", "name": "Can change permission", "content_type": 2}, "model": "auth.permission", "pk": 5}, {"fields": {"codename": "delete_permission", "name": "Can delete permission", "content_type": 2}, "model": "auth.permission", "pk": 6}, {"fields": {"codename": "add_group", "name": "Can add group", "content_type": 3}, "model": "auth.permission", "pk": 7}, {"fields": {"codename": "change_group", "name": "Can change group", "content_type": 3}, "model": "auth.permission", "pk": 8}, {"fields": {"codename": "delete_group", "name": "Can delete group", "content_type": 3}, "model": "auth.permission", "pk": 9}, {"fields": {"codename": "add_user", "name": "Can add user", "content_type": 4}, "model": "auth.permission", "pk": 10}, {"fields": {"codename": "change_user", "name": "Can change user", "content_type": 4}, "model": "auth.permission", "pk": 11}, {"fields": {"codename": "delete_user", "name": "Can delete user", "content_type": 4}, "model": "auth.permission", "pk": 12}, {"fields": {"codename": "add_contenttype", "name": "Can add content type", "content_type": 5}, "model": "auth.permission", "pk": 13}, {"fields": {"codename": "change_contenttype", "name": "Can change content type", "content_type": 5}, "model": "auth.permission", "pk": 14}, {"fields": {"codename": "delete_contenttype", "name": "Can delete content type", "content_type": 5}, "model": "auth.permission", "pk": 15}, {"fields": {"codename": "add_session", "name": "Can add session", "content_type": 6}, "model": "auth.permission", "pk": 16}, {"fields": {"codename": "change_session", "name": "Can change session", "content_type": 6}, "model": "auth.permission", "pk": 17}, {"fields": {"codename": "delete_session", "name": "Can delete session", "content_type": 6}, "model": "auth.permission", "pk": 18}, {"fields": {"codename": "add_post", "name": "Can add post", "content_type": 7}, "model": "auth.permission", "pk": 19}, {"fields": {"codename": "change_post", "name": "Can change post", "content_type": 7}, "model": "auth.permission", "pk": 20}, {"fields": {"codename": "delete_post", "name": "Can delete post", "content_type": 7}, "model": "auth.permission", "pk": 21}, {"fields": {"username": "vikrampriya", "first_name": "", "last_name": "", "is_active": true, "is_superuser": true, "is_staff": true, "last_login": "2015-04-05T15:22:59.836Z", "groups": [], "user_permissions": [], "password": "pbkdf2_sha256$15000$e9wWl7Nd6qcm$H+KIgqnHr0xVN4CVhB2RmwaAVPuSEwBwlIGEal/t4xA=", "email": "vik.sundaram@hotmail.com", "date_joined": "2015-04-05T15:22:44.223Z"}, "model": "auth.user", "pk": 1}, {"fields": {"action_flag": 1, "action_time": "2015-04-05T15:39:54.177Z", "object_repr": "Tite!: A Blog Post", "object_id": "1", "change_message": "", "user": 1, "content_type": 7}, "model": "admin.logentry", "pk": 1}, {"fields": {"action_flag": 2, "action_time": "2015-04-05T15:40:03.731Z", "object_repr": "Title: A Blog Post", "object_id": "1", "change_message": "Changed title.", "user": 1, "content_type": 7}, "model": "admin.logentry", "pk": 2}, {"fields": {"action_flag": 2, "action_time": "2015-04-05T15:51:38.022Z", "object_repr": "Title: A Blog Post", "object_id": "1", "change_message": "Changed is_project.", "user": 1, "content_type": 7}, "model": "admin.logentry", "pk": 3}, {"fields": {"action_flag": 2, "action_time": "2015-04-05T15:51:43.427Z", "object_repr": "Title: A Blog Post", "object_id": "1", "change_message": "Changed is_project.", "user": 1, "content_type": 7}, "model": "admin.logentry", "pk": 4}, {"fields": {"action_flag": 3, "action_time": "2015-04-05T15:54:41.605Z", "object_repr": "Title: A Blog Post", "object_id": "1", "change_message": "", "user": 1, "content_type": 7}, "model": "admin.logentry", "pk": 5}, {"fields": {"action_flag": 1, "action_time": "2015-04-14T19:47:21.654Z", "object_repr": "Trial Post: This is the first blog post. I'm testing it out. ", "object_id": "1", "change_message": "", "user": 1, "content_type": 7}, "model": "admin.logentry", "pk": 6}, {"fields": {"action_flag": 1, "action_time": "2015-04-15T00:46:54.416Z", "object_repr": "Another Trial: Lorem ipsum dolor sit amet, consectetur adipisicing elit, sed do eiusmod\r\ntempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam,\r\nquis nostrud exercitation ullamco", "object_id": "2", "change_message": "", "user": 1, "content_type": 7}, "model": "admin.logentry", "pk": 7}, {"fields": {"action_flag": 1, "action_time": "2015-04-15T01:29:46.721Z", "object_repr": "Third Trial Post: Here is the third trial post. Here is the third trial post. Here is the third trial post. Here is the third trial post. Here is the third trial post. Here is the third trial post. He", "object_id": "3", "change_message": "", "user": 1, "content_type": 7}, "model": "admin.logentry", "pk": 8}, {"fields": {"action_flag": 2, "action_time": "2015-04-15T01:30:06.153Z", "object_repr": "Third Trial Post: Here is the third trial post. Here is the third trial post. Here is the third trial post. Here is the third trial post. Here is the third trial post. Here is the third trial post. He", "object_id": "3", "change_message": "Changed published.", "user": 1, "content_type": 7}, "model": "admin.logentry", "pk": 9}, {"fields": {"action_flag": 2, "action_time": "2015-04-15T01:30:32.032Z", "object_repr": "Third Trial Post: Here is the third trial post. Here is the third trial post. Here is the third trial post. Here is the third trial post. Here is the third trial post. Here is the third trial post. He", "object_id": "3", "change_message": "Changed image.", "user": 1, "content_type": 7}, "model": "admin.logentry", "pk": 10}, {"fields": {"action_flag": 2, "action_time": "2015-04-15T01:31:13.425Z", "object_repr": "Third Trial Post: Here is the third trial post. Here is the third trial post. Here is the third trial post. Here is the third trial post. Here is the third trial post. Here is the third trial post. He", "object_id": "3", "change_message": "Changed is_project and image.", "user": 1, "content_type": 7}, "model": "admin.logentry", "pk": 11}, {"fields": {"action_flag": 2, "action_time": "2015-04-15T01:37:16.775Z", "object_repr": "Third Trial Post: Here is the third trial post. Here is the third trial post. Here is the third trial post. Here is the third trial post. Here is the third trial post. Here is the third trial post. He", "object_id": "3", "change_message": "Changed image.", "user": 1, "content_type": 7}, "model": "admin.logentry", "pk": 12}, {"fields": {"action_flag": 2, "action_time": "2015-04-15T01:38:03.595Z", "object_repr": "Another Trial: Lorem ipsum dolor sit amet, consectetur adipisicing elit, sed do eiusmod\r\ntempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam,\r\nquis nostrud exercitation ullamco", "object_id": "2", "change_message": "Changed short_description.", "user": 1, "content_type": 7}, "model": "admin.logentry", "pk": 13}, {"fields": {"action_flag": 1, "action_time": "2015-04-15T15:54:50.677Z", "object_repr": "OncoTime : This article describes the OncoTime Programming Language project I developed while at McGill University. ", "object_id": "4", "change_message": "", "user": 1, "content_type": 7}, "model": "admin.logentry", "pk": 14}, {"fields": {"action_flag": 1, "action_time": "2015-04-15T15:55:50.166Z", "object_repr": "Microsoft: This article describes the two projects I worked on while at Microsoft last Summer; Recipe Guide and OpenStates. It gives an introduction to both apps, along with the technologies used. ", "object_id": "5", "change_message": "", "user": 1, "content_type": 7}, "model": "admin.logentry", "pk": 15}, {"fields": {"action_flag": 1, "action_time": "2015-04-15T15:56:58.900Z", "object_repr": "Spaceships: This article describes Spaceships: Battle for the Frontier. It is a 2D, real time, online multiplayer game, written in Java. The article should give the reader of what Spaceships was and h", "object_id": "6", "change_message": "", "user": 1, "content_type": 7}, "model": "admin.logentry", "pk": 16}, {"fields": {"action_flag": 1, "action_time": "2015-04-15T15:58:18.694Z", "object_repr": "Five Do's For Developers: We discuss what the top five things all developers should do. This should give the reader a good idea of how to develop their developer skills. ", "object_id": "7", "change_message": "", "user": 1, "content_type": 7}, "model": "admin.logentry", "pk": 17}, {"fields": {"action_flag": 1, "action_time": "2015-04-15T15:59:14.372Z", "object_repr": "Five Don'ts For Developers: In tandem with the Five Do's For Developers Article, this article gives the reader an idea of what to avoid as a developer. ", "object_id": "8", "change_message": "", "user": 1, "content_type": 7}, "model": "admin.logentry", "pk": 18}, {"fields": {"action_flag": 3, "action_time": "2015-04-15T15:59:25.271Z", "object_repr": "Third Trial Post: Here is the third trial post. Here is the third trial post. Here is the third trial post. Here is the third trial post. Here is the third trial post. Here is the third trial post. He", "object_id": "3", "change_message": "", "user": 1, "content_type": 7}, "model": "admin.logentry", "pk": 19}, {"fields": {"action_flag": 3, "action_time": "2015-04-15T15:59:25.273Z", "object_repr": "Another Trial: Lorem ipsum dolor sit amet, consectetur adipisicing elit, sed do eiusmod\r\ntempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam,\r\nquis nostrud exercitation ullamco", "object_id": "2", "change_message": "", "user": 1, "content_type": 7}, "model": "admin.logentry", "pk": 20}, {"fields": {"action_flag": 3, "action_time": "2015-04-15T15:59:25.274Z", "object_repr": "Trial Post: This is the first blog post. I'm testing it out. ", "object_id": "1", "change_message": "", "user": 1, "content_type": 7}, "model": "admin.logentry", "pk": 21}, {"fields": {"action_flag": 2, "action_time": "2015-04-15T16:22:59.390Z", "object_repr": "Five Don'ts For Developers: In tandem with the Five Do's For Developers Article, this article gives the reader an idea of what to avoid as a developer. ", "object_id": "8", "change_message": "Changed content.", "user": 1, "content_type": 7}, "model": "admin.logentry", "pk": 22}, {"fields": {"action_flag": 2, "action_time": "2015-04-15T16:23:07.300Z", "object_repr": "Five Do's For Developers: We discuss what the top five things all developers should do. This should give the reader a good idea of how to develop their developer skills. ", "object_id": "7", "change_message": "Changed content.", "user": 1, "content_type": 7}, "model": "admin.logentry", "pk": 23}, {"fields": {"action_flag": 2, "action_time": "2015-04-15T16:23:13.482Z", "object_repr": "Spaceships: This article describes Spaceships: Battle for the Frontier. It is a 2D, real time, online multiplayer game, written in Java. The article should give the reader of what Spaceships was and h", "object_id": "6", "change_message": "Changed content.", "user": 1, "content_type": 7}, "model": "admin.logentry", "pk": 24}, {"fields": {"action_flag": 2, "action_time": "2015-04-15T16:23:19.721Z", "object_repr": "Microsoft: This article describes the two projects I worked on while at Microsoft last Summer; Recipe Guide and OpenStates. It gives an introduction to both apps, along with the technologies used. ", "object_id": "5", "change_message": "Changed content.", "user": 1, "content_type": 7}, "model": "admin.logentry", "pk": 25}, {"fields": {"action_flag": 2, "action_time": "2015-04-15T16:23:24.788Z", "object_repr": "Microsoft: This article describes the two projects I worked on while at Microsoft last Summer; Recipe Guide and OpenStates. It gives an introduction to both apps, along with the technologies used. ", "object_id": "5", "change_message": "No fields changed.", "user": 1, "content_type": 7}, "model": "admin.logentry", "pk": 26}, {"fields": {"action_flag": 2, "action_time": "2015-04-15T16:23:35.346Z", "object_repr": "OncoTime : This article describes the OncoTime Programming Language project I developed while at McGill University. ", "object_id": "4", "change_message": "Changed content.", "user": 1, "content_type": 7}, "model": "admin.logentry", "pk": 27}, {"fields": {"action_flag": 2, "action_time": "2015-04-15T16:23:57.967Z", "object_repr": "The Five Things Every Developer Should Not Do: In tandem with the Five Do's For Developers Article, this article gives the reader an idea of what to avoid as a developer. ", "object_id": "8", "change_message": "Changed title.", "user": 1, "content_type": 7}, "model": "admin.logentry", "pk": 28}, {"fields": {"action_flag": 2, "action_time": "2015-04-15T16:24:09.209Z", "object_repr": "The Five Things Every Developer Should Do: We discuss what the top five things all developers should do. This should give the reader a good idea of how to develop their developer skills. ", "object_id": "7", "change_message": "Changed title.", "user": 1, "content_type": 7}, "model": "admin.logentry", "pk": 29}, {"fields": {"action_flag": 2, "action_time": "2015-04-15T16:24:17.474Z", "object_repr": "Spaceships: Battle for the Frontier: This article describes Spaceships: Battle for the Frontier. It is a 2D, real time, online multiplayer game, written in Java. The article should give the reader of ", "object_id": "6", "change_message": "Changed title.", "user": 1, "content_type": 7}, "model": "admin.logentry", "pk": 30}, {"fields": {"action_flag": 2, "action_time": "2015-04-15T16:24:28.383Z", "object_repr": "My Summer Projects at Microsoft: This article describes the two projects I worked on while at Microsoft last Summer; Recipe Guide and OpenStates. It gives an introduction to both apps, along with the ", "object_id": "5", "change_message": "Changed title.", "user": 1, "content_type": 7}, "model": "admin.logentry", "pk": 31}, {"fields": {"action_flag": 2, "action_time": "2015-04-15T16:24:36.343Z", "object_repr": "The OncoTime Programming Language: This article describes the OncoTime Programming Language project I developed while at McGill University. ", "object_id": "4", "change_message": "Changed title.", "user": 1, "content_type": 7}, "model": "admin.logentry", "pk": 32}, {"fields": {"action_flag": 2, "action_time": "2015-04-15T17:32:21.832Z", "object_repr": "The OncoTime Programming Language: This article describes the OncoTime Programming Language project I developed while at McGill University. ", "object_id": "4", "change_message": "Changed content.", "user": 1, "content_type": 7}, "model": "admin.logentry", "pk": 33}, {"fields": {"action_flag": 2, "action_time": "2015-04-15T17:49:49.462Z", "object_repr": "My Summer Projects at Microsoft: This article describes the two projects I worked on while at Microsoft last Summer; Recipe Guide and OpenStates. It gives an introduction to both apps, along with the ", "object_id": "5", "change_message": "Changed content.", "user": 1, "content_type": 7}, "model": "admin.logentry", "pk": 34}, {"fields": {"action_flag": 2, "action_time": "2015-04-15T17:51:00.930Z", "object_repr": "My Summer Projects at Microsoft: This article describes the two projects I worked on while at Microsoft last Summer; Recipe Guide and OpenStates. It gives an introduction to both apps, along with the ", "object_id": "5", "change_message": "Changed content.", "user": 1, "content_type": 7}, "model": "admin.logentry", "pk": 35}, {"fields": {"action_flag": 2, "action_time": "2015-04-15T17:51:30.644Z", "object_repr": "My Summer Projects at Microsoft: This article describes the two projects I worked on while at Microsoft last Summer; Recipe Guide and OpenStates. It gives an introduction to both apps, along with the ", "object_id": "5", "change_message": "Changed content.", "user": 1, "content_type": 7}, "model": "admin.logentry", "pk": 36}, {"fields": {"action_flag": 2, "action_time": "2015-04-15T17:52:42.902Z", "object_repr": "My Summer Projects at Microsoft: This article describes the two projects I worked on while at Microsoft last Summer; Recipe Guide and OpenStates. It gives an introduction to both apps, along with the ", "object_id": "5", "change_message": "No fields changed.", "user": 1, "content_type": 7}, "model": "admin.logentry", "pk": 37}, {"fields": {"action_flag": 2, "action_time": "2015-04-15T17:54:03.815Z", "object_repr": "Asteria: Battle for the Frontier: This article describes Asteria: Battle for the Frontier. It is a 2D, real time, online multiplayer game, written in Java. The article should give the reader of what A", "object_id": "6", "change_message": "Changed title, short_description and content.", "user": 1, "content_type": 7}, "model": "admin.logentry", "pk": 38}, {"fields": {"action_flag": 2, "action_time": "2015-04-15T17:55:54.911Z", "object_repr": "Asteria: Battle for the Frontier: This article describes Asteria: Battle for the Frontier. It is a 2D, real time, online multiplayer game, written in Java. The article should give the reader of what A", "object_id": "6", "change_message": "Changed content.", "user": 1, "content_type": 7}, "model": "admin.logentry", "pk": 39}, {"fields": {"action_flag": 2, "action_time": "2015-04-15T17:56:26.515Z", "object_repr": "The Five Things Every Developer Should Not Do: In tandem with the Five Do's For Developers Article, this article gives the reader an idea of what to avoid as a developer. ", "object_id": "8", "change_message": "Changed content.", "user": 1, "content_type": 7}, "model": "admin.logentry", "pk": 40}]